In [1]:
import numpy as np
import pandas as pd
import warnings

In [2]:
warnings.filterwarnings('ignore')

In [8]:
column_name=['user_id','item_id','rating','timestamp']

In [9]:
data=pd.read_csv('u.data',sep='\t',names=column_name)

In [10]:
data

       user_id  item_id  rating  timestamp
0          196      242       3  881250949
1          186      302       3  891717742
2           22      377       1  878887116
3          244       51       2  880606923
4          166      346       1  886397596
...        ...      ...     ...        ...
99995      880      476       3  880175444
99996      716      204       5  879795543
99997      276     1090       1  874795795
99998       13      225       2  882399156
99999       12      203       3  879959583

[100000 rows x 4 columns]

In [11]:
data.head()

   user_id  item_id  rating  timestamp
0      196      242       3  881250949
1      186      302       3  891717742
2       22      377       1  878887116
3      244       51       2  880606923
4      166      346       1  886397596

In [12]:
data.tail(10)

       user_id  item_id  rating  timestamp
99990      806      421       4  882388897
99991      676      538       4  892685437
99992      721      262       3  877137285
99993      913      209       2  881367150
99994      378       78       3  880056976
99995      880      476       3  880175444
99996      716      204       5  879795543
99997      276     1090       1  874795795
99998       13      225       2  882399156
99999       12      203       3  879959583

In [13]:
dropping=data.drop(['timestamp'],axis=1)

In [14]:
dropping

       user_id  item_id  rating
0          196      242       3
1          186      302       3
2           22      377       1
3          244       51       2
4          166      346       1
...        ...      ...     ...
99995      880      476       3
99996      716      204       5
99997      276     1090       1
99998       13      225       2
99999       12      203       3

[100000 rows x 3 columns]

In [16]:
data.shape

(100000, 4)

In [17]:
data.describe()

            user_id        item_id         rating     timestamp
count  100000.00000  100000.000000  100000.000000  1.000000e+05
mean      462.48475     425.530130       3.529860  8.835289e+08
std       266.61442     330.798356       1.125674  5.343856e+06
min         1.00000       1.000000       1.000000  8.747247e+08
25%       254.00000     175.000000       3.000000  8.794487e+08
50%       447.00000     322.000000       4.000000  8.828269e+08
75%       682.00000     631.000000       4.000000  8.882600e+08
max       943.00000    1682.000000       5.000000  8.932866e+08

In [ ]:
data['user_id'].unique()

In [19]:
data['user_id'].nunique()

943

In [20]:
data['item_id'].unique()

array([ 242,  302,  377, ..., 1637, 1630, 1641])

In [21]:
data['item_id'].nunique()

1682

In [43]:
movie_title=pd.read_csv('u.item',sep='|',header=None,encoding='ISO-8859-1')

In [44]:
movie_title

        0                                          1            2   ...  21 22  23
0        1                           Toy Story (1995)  01-Jan-1995  ...   0  0   0
1        2                           GoldenEye (1995)  01-Jan-1995  ...   1  0   0
2        3                          Four Rooms (1995)  01-Jan-1995  ...   1  0   0
3        4                          Get Shorty (1995)  01-Jan-1995  ...   0  0   0
4        5                             Copycat (1995)  01-Jan-1995  ...   1  0   0
...    ...                                        ...          ...  ...  .. ..  ..
1677  1678                          Mat' i syn (1997)  06-Feb-1998  ...   0  0   0
1678  1679                           B. Monkey (1998)  06-Feb-1998  ...   1  0   0
1679  1680                       Sliding Doors (1998)  01-Jan-1998  ...   0  0   0
1680  1681                        You So Crazy (1994)  01-Jan-1994  ...   0  0   0
1681  1682  Scream of Stone (Schrei aus Stein) (1991)  08-Mar-1996  ...   0  0   0

[1682 rows x 24 columns]

In [45]:
movie_title=movie_title[[0,1]]

In [46]:
movie_title

         0                                          1
0        1                           Toy Story (1995)
1        2                           GoldenEye (1995)
2        3                          Four Rooms (1995)
3        4                          Get Shorty (1995)
4        5                             Copycat (1995)
...    ...                                        ...
1677  1678                          Mat' i syn (1997)
1678  1679                           B. Monkey (1998)
1679  1680                       Sliding Doors (1998)
1680  1681                        You So Crazy (1994)
1681  1682  Scream of Stone (Schrei aus Stein) (1991)

[1682 rows x 2 columns]

In [47]:
#Defining our own column
movie_title.columns=['item_id','title']

In [48]:
movie_title

      item_id                                      title
0           1                           Toy Story (1995)
1           2                           GoldenEye (1995)
2           3                          Four Rooms (1995)
3           4                          Get Shorty (1995)
4           5                             Copycat (1995)
...       ...                                        ...
1677     1678                          Mat' i syn (1997)
1678     1679                           B. Monkey (1998)
1679     1680                       Sliding Doors (1998)
1680     1681                        You So Crazy (1994)
1681     1682  Scream of Stone (Schrei aus Stein) (1991)

[1682 rows x 2 columns]

In [49]:
#MERGING TWO DATAFRAME
df=pd.merge(data,movie_title,on='item_id')

In [50]:
df

       user_id  ...                                              title
0          196  ...                                       Kolya (1996)
1           63  ...                                       Kolya (1996)
2          226  ...                                       Kolya (1996)
3          154  ...                                       Kolya (1996)
4          306  ...                                       Kolya (1996)
...        ...  ...                                                ...
99995      840  ...                                  Mamma Roma (1962)
99996      655  ...                             Eighth Day, The (1996)
99997      655  ...                                  Girls Town (1996)
99998      655  ...  Silence of the Palace, The (Saimt el Qusur) (1...
99999      655  ...                                    Dadetown (1995)

[100000 rows x 5 columns]

In [51]:
df.sort_index()

       user_id  ...                                              title
0          196  ...                                       Kolya (1996)
1           63  ...                                       Kolya (1996)
2          226  ...                                       Kolya (1996)
3          154  ...                                       Kolya (1996)
4          306  ...                                       Kolya (1996)
...        ...  ...                                                ...
99995      840  ...                                  Mamma Roma (1962)
99996      655  ...                             Eighth Day, The (1996)
99997      655  ...                                  Girls Town (1996)
99998      655  ...  Silence of the Palace, The (Saimt el Qusur) (1...
99999      655  ...                                    Dadetown (1995)

[100000 rows x 5 columns]

In [52]:
#homework: if we want to sort according any other attribute than item_id
df.groupby('title')

In [53]:
df.groupby('title').mean()

                                          user_id  ...     timestamp
title                                              ...
'Til There Was You (1997)              383.777778  ...  8.861152e+08
1-900 (1994)                           477.000000  ...  8.797260e+08
101 Dalmatians (1996)                  450.330275  ...  8.829281e+08
12 Angry Men (1957)                    453.552000  ...  8.828963e+08
187 (1997)                             517.097561  ...  8.850084e+08
...                                           ...  ...           ...
Young Guns II (1990)                   504.068182  ...  8.821855e+08
Young Poisoner's Handbook, The (1995)  452.487805  ...  8.821438e+08
Zeus and Roxanne (1997)                532.833333  ...  8.775338e+08
unknown                                311.888889  ...  8.756379e+08
Á köldum klaka (Cold Fever) (1994)     655.000000  ...  8.893313e+08

[1664 rows x 4 columns]

In [60]:
df.groupby('title').mean()['rating']

title
'Til There Was You (1997)                2.333333
1-900 (1994)                             2.600000
101 Dalmatians (1996)                    2.908257
12 Angry Men (1957)                      4.344000
187 (1997)                               3.024390
                                           ...
Young Guns II (1990)                     2.772727
Young Poisoner's Handbook, The (1995)    3.341463
Zeus and Roxanne (1997)                  2.166667
unknown                                  3.444444
Á köldum klaka (Cold Fever) (1994)       3.000000
Name: rating, Length: 1664, dtype: float64

In [62]:
X=df.groupby('title').mean()['rating'].sort_values(ascending=False)

In [64]:
X.head(10)

title
Marlene Dietrich: Shadow and Light (1996)            5.0
Prefontaine (1997)                                   5.0
Santa with Muscles (1996)                            5.0
Star Kid (1997)                                      5.0
Someone Else's America (1995)                        5.0
Entertaining Angels: The Dorothy Day Story (1996)    5.0
Saint of Fort Washington, The (1993)                 5.0
Great Day in Harlem, A (1994)                        5.0
They Made Me a Criminal (1939)                       5.0
Aiqing wansui (1994)                                 5.0
Name: rating, dtype: float64

In [65]:
df.groupby('title').count()

                                       user_id  item_id  ...  timestamp  mean
title                                                    ...
'Til There Was You (1997)                    9        9  ...          9     0
1-900 (1994)                                 5        5  ...          5     0
101 Dalmatians (1996)                      109      109  ...        109     0
12 Angry Men (1957)                        125      125  ...        125     0
187 (1997)                                  41       41  ...         41     0
...                                        ...      ...  ...        ...   ...
Young Guns II (1990)                        44       44  ...         44     0
Young Poisoner's Handbook, The (1995)       41       41  ...         41     0
Zeus and Roxanne (1997)                      6        6  ...          6     0
unknown                                      9        9  ...          9     0
Á köldum klaka (Cold Fever) (1994)           1        1  ...          1     0

[1664 rows x 5 columns]

In [66]:
df.groupby('title').count()['rating']

title
'Til There Was You (1997)                  9
1-900 (1994)                               5
101 Dalmatians (1996)                    109
12 Angry Men (1957)                      125
187 (1997)                                41
                                        ...
Young Guns II (1990)                      44
Young Poisoner's Handbook, The (1995)     41
Zeus and Roxanne (1997)                    6
unknown                                    9
Á köldum klaka (Cold Fever) (1994)         1
Name: rating, Length: 1664, dtype: int64

In [68]:
#Most Rated Movie
df.groupby('title').count()['rating'].sort_values(ascending=False)

title
Star Wars (1977)                              583
Contact (1997)                                509
Fargo (1996)                                  508
Return of the Jedi (1983)                     507
Liar Liar (1997)                              485
                                             ...
Man from Down Under, The (1943)                 1
Marlene Dietrich: Shadow and Light (1996)       1
Mat' i syn (1997)                               1
Mille bolle blu (1993)                          1
Á köldum klaka (Cold Fever) (1994)              1
Name: rating, Length: 1664, dtype: int64

In [69]:
Ratings_movies=pd.DataFrame(df.groupby('title').mean()['rating'])

In [70]:
Ratings_movies

                                         rating
title
'Til There Was You (1997)              2.333333
1-900 (1994)                           2.600000
101 Dalmatians (1996)                  2.908257
12 Angry Men (1957)                    4.344000
187 (1997)                             3.024390
...                                         ...
Young Guns II (1990)                   2.772727
Young Poisoner's Handbook, The (1995)  3.341463
Zeus and Roxanne (1997)                2.166667
unknown                                3.444444
Á köldum klaka (Cold Fever) (1994)     3.000000

[1664 rows x 1 columns]

In [71]:
Ratings_movies['no of ratings']=pd.DataFrame(df.groupby('title').count()['rating'])

In [72]:
Ratings_movies

                                         rating  no of ratings
title
'Til There Was You (1997)              2.333333              9
1-900 (1994)                           2.600000              5
101 Dalmatians (1996)                  2.908257            109
12 Angry Men (1957)                    4.344000            125
187 (1997)                             3.024390             41
...                                         ...            ...
Young Guns II (1990)                   2.772727             44
Young Poisoner's Handbook, The (1995)  3.341463             41
Zeus and Roxanne (1997)                2.166667              6
unknown                                3.444444              9
Á köldum klaka (Cold Fever) (1994)     3.000000              1

[1664 rows x 2 columns]